import { fill } from "./fill.js";
describe('тесты для функции fill', () => {
  test("Должна заполнить весь массив: fill([1, 2, 3], 0) → массив [0, 0, 0]",()=>{
    expect(fill([1, 2, 3], 0)).toEqual([0, 0, 0])
  })
  test("Должна заполнить часть от start до end: fill([1, 2, 3, 4], '*', 1, 3) → [1, '*', '*', 4]", ()=>{
    expect(fill([1, 2, 3, 4], '*', 1, 3)).toEqual([1, '*', '*', 4])
  })
   test("Должна вернуть тот же массив (проверь === между переданным массивом и возвращённым)", ()=>{
    const arr = [1, 2, 3];
    const result = fill(arr, 0);
    expect(result).toBe(arr);
  })
   test("Должна работать с пустым массивом: fill([], 5) → []", ()=>{
    expect(fill([], 5)).toEqual([])
  })
  test("Должна ничего не менять если start >= end: fill([1, 2, 3], 0, 2, 1) → [1, 2, 3]", ()=>{
    expect(fill([1, 2, 3], 0, 2, 1)).toEqual([1, 2, 3])
  })
  test("Должна поддерживать отрицательный start: fill([1, 2, 3, 4], '*', -2) → [1, 2, '*', '*']", ()=>{
    expect(fill([1, 2, 3, 4], '*', -2)).toEqual([1, 2, '*', '*'])
  })  
  test("Должна поддерживать отрицательный end: fill([1, 2, 3, 4], '*', 0, -1) → ['*', '*', '*', 4]", ()=>{
    expect(fill([1, 2, 3, 4], '*', 0, -1)).toEqual(['*', '*', '*', 4])
  })
  test("Должна работать с start и end по умолчанию: fill([1, 2, 3], 'a') → ['a', 'a', 'a']", ()=>{
    expect(fill([1, 2, 3], 'a')).toEqual(['a', 'a', 'a'])
  })
  test("Должна нормализовать start > len: fill([1, 2], 5, 5) → [1, 2] (без изменений)", ()=>{
    expect(fill([1, 2], 5, 5)).toEqual([1, 2])
  })
  test("Должна нормализовать отрицательный start уходящий за границу: fill([1, 2, 3], '*', -10, 2) → ['*', '*', 3]", ()=>{
    expect(fill([1, 2, 3], '*', -10, 2)).toEqual(['*', '*', 3])
  })
  test("Должна выбросить TypeError если arr не массив", ()=>{
    expect(()=>fill('hello', '$', 8, 2)).toThrow(TypeError)
  })
  test("Должна выбросить TypeError если start, end не числа", ()=>{
    expect(()=>fill([1, 2, 3], '@', 'a', 'b')).toThrow(TypeError)
  })


})
