import { flat } from "./flat.js";
describe('Тесты для функции flat', () => {
  test("Должна разгладить один уровень: flat([1, [2, 3], 4]) → [1, 2, 3, 4]", ()=>{
    expect(flat([1, [2, 3], 4])).toEqual([1, 2, 3, 4])
  })
  test("Должна разгладить два уровня: flat([1, [2, [3, 4]]], 2) → [1, 2, 3, 4]", ()=>{
    expect(flat([1, [2, [3, 4]]], 2)).toEqual([1, 2, 3, 4])
  })
  test("Должна разгладить полностью с Infinity: flat([1, [2, [3, [4]]]], Infinity) → [1, 2, 3, 4]", ()=>{
    expect(flat([1, [2, [3, [4]]]], Infinity)).toEqual([1, 2, 3, 4])
  })
  test("Должна вернуть копию для уже плоского массива: flat([1, 2, 3]) → [1, 2, 3], и исходный !== результат", ()=>{
    expect(flat([1, 2, 3])).toEqual([1, 2, 3])
  })
  test("Должна вернуть пустой массив для пустого: flat([]) → []", ()=>{
    expect(flat([])).toEqual([])
  })
  test("Должна не разглаживать при depth = 0: flat([1, [2, 3]], 0) → [1, [2, 3]]", ()=>{
    expect(flat([1, [2, 3]], 0)).toEqual([1, [2, 3]])
  })
  test("Должна обрабатывать смешанную вложенность с глубиной по умолчанию: flat([1, [2], [3, [4]]]) → [1, 2, 3, [4]]", ()=>{
    expect(flat([1, [2], [3, [4]]])).toEqual([1, 2, 3, [4]])
  })
  test("Должна выбросить TypeError если arr не массив", ()=>{
    expect(() => flat('hello', 2)).toThrow(TypeError)
  })
  test("Должна выбросить TypeError если depth передан и не число", ()=>{
    expect(() => flat([1, 2, [3], 4], 'hello')).toThrow(TypeError)
  })



})
